Revit 2026 API

# AnalysisResultSchemaSetUnits Method

---
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetUnits(
	IList<string> names,
	IList<double> multipliers
)
```
```vb
Public Sub SetUnits (
	names As IList(Of String),
	multipliers As IList(Of Double)
)
```
```cpp
public:
void SetUnits(
	IList<String^>^ names,
	IList<double>^ multipliers
)
```
```fsharp
member SetUnits :
        names : IList<string> *
        multipliers : IList<float> -> unit
```

#### Parameters

names IListString

multipliers IListDouble

#### Reference

AnalysisResultSchema Class

Autodesk.Revit.DB.Analysis Namespace